In [84]:
import pandas as pd
pd.options.mode.chained_assignment = None  # default='warn'

### Read and clean csv

In [75]:
df = pd.read_csv("las2.csv").drop(columns=["Timestamp", "Empty"]).rename(columns={
    "What is your name?": "name",
    "For each of the following, choose which days and times you are available (Please try to put at LEAST 10 available slots)": "times"
})
df.head()

              name                                              times
0        Amy Clark  Monday 1-2, Monday 2-3, Monday 3-4, Monday 4-5...
1    Ruchi Sarkar   Monday 10-11, Monday 1-2, Tues 10-11, Tues 11-...
2       Dana Rubin  Monday 10-11, Monday 1-2, Monday 4-5, Tues 1-2...
3  Nidhi Murlidhar  Monday 4-5, Tues 10-11, Tues 11-12, Tues 12-1,...
4              NaN  Monday 10-11, Monday 1-2, Monday 2-3, Monday 3...

In [63]:
all_times = set()

for index, row in df.iterrows():
    times = str(row["times"]).split(", ")
    for t in times:
        if t not in all_times:
            all_times.add(t)
            
all_times = list(all_times)

In [64]:
all_times

['Monday 4-5',
 'Tues 11-12',
 'Tues 12-1',
 'Tues 4-5',
 'Thur 3-4',
 'Wed 11-12',
 'Thur 4-5',
 'Monday 10-11',
 'Monday 12-1',
 'Monday 1-2',
 'Thur 2-3',
 'Thur 11-12',
 'Wed 12-1',
 'Monday 2-3',
 'Monday 3-4',
 'Wed 10-11',
 'Wed 2-3',
 'Thur 12-1',
 'Tues 2-3',
 'Wed 3-4',
 'Wed 1-2',
 'Thur 10-11',
 'Wed 4-5',
 'nan',
 'Monday 11-12',
 'Tues 1-2',
 'Thur 1-2',
 'Tues 3-4',
 'Tues 10-11']

### Sort times

In [70]:
days = ["Monday", "Tues", "Wed", "Thur"]
time_order = ["10-11", "11-12", "12-1", "1-2", "2-3", "3-4", "4-5"]
sorted_times = []

for d in days:
    curr_day = [x for x in all_times if d in x]
    for t in time_order:
        for c in curr_day:
            if t in c:
                sorted_times.append(c)
                
print(sorted_times)

['Monday 10-11', 'Monday 11-12', 'Monday 12-1', 'Monday 1-2', 'Monday 2-3', 'Monday 3-4', 'Monday 4-5', 'Tues 10-11', 'Tues 11-12', 'Tues 12-1', 'Tues 1-2', 'Tues 2-3', 'Tues 3-4', 'Tues 4-5', 'Wed 10-11', 'Wed 11-12', 'Wed 12-1', 'Wed 1-2', 'Wed 2-3', 'Wed 3-4', 'Wed 4-5', 'Thur 10-11', 'Thur 11-12', 'Thur 12-1', 'Thur 1-2', 'Thur 2-3', 'Thur 3-4', 'Thur 4-5']

### Add time columns

In [87]:
for t in sorted_times:
    df[t] = 0
    
for index, row in df.iterrows():
    for t in sorted_times:
        if t in str(row["times"]).split(", "):
            df[t][index] = 1

df.head(2)

,name,times,Monday 10-11,Monday 11-12,Monday 12-1,Monday 1-2,Monday 2-3,Monday 3-4,Monday 4-5,Tues 10-11,...,Wed 2-3,Wed 3-4,Wed 4-5,Thur 10-11,Thur 11-12,Thur 12-1,Thur 1-2,Thur 2-3,Thur 3-4,Thur 4-5
0,Amy Clark,"Monday 1-2, Monday 2-3, Monday 3-4, Monday 4-5...",0,0,0,1,1,1,1,0,...,1,0,0,0,0,0,0,0,0,0
1,Ruchi Sarkar,"Monday 10-11, Monday 1-2, Tues 10-11, Tues 11-...",1,0,0,1,0,0,0,1,...,0,0,0,1,1,0,0,1,0,0